renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/8_CAN_driver/Examples/CAN_Example2_Interrupt_Loop_Back_Mode/Autosar/Mcal/Base/header/S32K146_ADC.h
#define ADC_SC1J_COCO_MASK                       (0x80U)
#define ADC_SC1J_COCO_SHIFT                      (7U)
#define ADC_SC1J_COCO_WIDTH                      (1U)
#define ADC_SC1J_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1J_COCO_SHIFT)) & ADC_SC1J_COCO_MASK)
/*! @} */

/*! @name SC1K - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1K_ADCH_MASK                       (0x3FU)
#define ADC_SC1K_ADCH_SHIFT                      (0U)
#define ADC_SC1K_ADCH_WIDTH                      (6U)
#define ADC_SC1K_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1K_ADCH_SHIFT)) & ADC_SC1K_ADCH_MASK)

#define ADC_SC1K_AIEN_MASK                       (0x40U)
#define ADC_SC1K_AIEN_SHIFT                      (6U)
#define ADC_SC1K_AIEN_WIDTH                      (1U)
#define ADC_SC1K_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1K_AIEN_SHIFT)) & ADC_SC1K_AIEN_MASK)

#define ADC_SC1K_COCO_MASK                       (0x80U)
#define ADC_SC1K_COCO_SHIFT                      (7U)
#define ADC_SC1K_COCO_WIDTH                      (1U)
#define ADC_SC1K_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1K_COCO_SHIFT)) & ADC_SC1K_COCO_MASK)
/*! @} */

/*! @name SC1L - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1L_ADCH_MASK                       (0x3FU)
#define ADC_SC1L_ADCH_SHIFT                      (0U)
#define ADC_SC1L_ADCH_WIDTH                      (6U)
#define ADC_SC1L_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1L_ADCH_SHIFT)) & ADC_SC1L_ADCH_MASK)

#define ADC_SC1L_AIEN_MASK                       (0x40U)
#define ADC_SC1L_AIEN_SHIFT                      (6U)
#define ADC_SC1L_AIEN_WIDTH                      (1U)
#define ADC_SC1L_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1L_AIEN_SHIFT)) & ADC_SC1L_AIEN_MASK)

#define ADC_SC1L_COCO_MASK                       (0x80U)
#define ADC_SC1L_COCO_SHIFT                      (7U)
#define ADC_SC1L_COCO_WIDTH                      (1U)
#define ADC_SC1L_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1L_COCO_SHIFT)) & ADC_SC1L_COCO_MASK)
/*! @} */

/*! @name SC1M - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1M_ADCH_MASK                       (0x3FU)
#define ADC_SC1M_ADCH_SHIFT                      (0U)
#define ADC_SC1M_ADCH_WIDTH                      (6U)
#define ADC_SC1M_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1M_ADCH_SHIFT)) & ADC_SC1M_ADCH_MASK)

#define ADC_SC1M_AIEN_MASK                       (0x40U)
#define ADC_SC1M_AIEN_SHIFT                      (6U)
#define ADC_SC1M_AIEN_WIDTH                      (1U)
#define ADC_SC1M_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1M_AIEN_SHIFT)) & ADC_SC1M_AIEN_MASK)

#define ADC_SC1M_COCO_MASK                       (0x80U)
#define ADC_SC1M_COCO_SHIFT                      (7U)
#define ADC_SC1M_COCO_WIDTH                      (1U)
#define ADC_SC1M_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1M_COCO_SHIFT)) & ADC_SC1M_COCO_MASK)
/*! @} */

/*! @name SC1N - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1N_ADCH_MASK                       (0x3FU)
#define ADC_SC1N_ADCH_SHIFT                      (0U)
#define ADC_SC1N_ADCH_WIDTH                      (6U)
#define ADC_SC1N_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1N_ADCH_SHIFT)) & ADC_SC1N_ADCH_MASK)

#define ADC_SC1N_AIEN_MASK                       (0x40U)
#define ADC_SC1N_AIEN_SHIFT                      (6U)
#define ADC_SC1N_AIEN_WIDTH                      (1U)
#define ADC_SC1N_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1N_AIEN_SHIFT)) & ADC_SC1N_AIEN_MASK)

#define ADC_SC1N_COCO_MASK                       (0x80U)
#define ADC_SC1N_COCO_SHIFT                      (7U)
#define ADC_SC1N_COCO_WIDTH                      (1U)
#define ADC_SC1N_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1N_COCO_SHIFT)) & ADC_SC1N_COCO_MASK)
/*! @} */

/*! @name SC1O - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1O_ADCH_MASK                       (0x3FU)
#define ADC_SC1O_ADCH_SHIFT                      (0U)
#define ADC_SC1O_ADCH_WIDTH                      (6U)
#define ADC_SC1O_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1O_ADCH_SHIFT)) & ADC_SC1O_ADCH_MASK)

#define ADC_SC1O_AIEN_MASK                       (0x40U)
#define ADC_SC1O_AIEN_SHIFT                      (6U)
#define ADC_SC1O_AIEN_WIDTH                      (1U)
#define ADC_SC1O_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1O_AIEN_SHIFT)) & ADC_SC1O_AIEN_MASK)

#define ADC_SC1O_COCO_MASK                       (0x80U)
#define ADC_SC1O_COCO_SHIFT                      (7U)
#define ADC_SC1O_COCO_WIDTH                      (1U)
#define ADC_SC1O_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1O_COCO_SHIFT)) & ADC_SC1O_COCO_MASK)
/*! @} */

/*! @name SC1P - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_SC1P_ADCH_MASK                       (0x3FU)
#define ADC_SC1P_ADCH_SHIFT                      (0U)
#define ADC_SC1P_ADCH_WIDTH                      (6U)
#define ADC_SC1P_ADCH(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1P_ADCH_SHIFT)) & ADC_SC1P_ADCH_MASK)

#define ADC_SC1P_AIEN_MASK                       (0x40U)
#define ADC_SC1P_AIEN_SHIFT                      (6U)
#define ADC_SC1P_AIEN_WIDTH                      (1U)
#define ADC_SC1P_AIEN(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1P_AIEN_SHIFT)) & ADC_SC1P_AIEN_MASK)

#define ADC_SC1P_COCO_MASK                       (0x80U)
#define ADC_SC1P_COCO_SHIFT                      (7U)
#define ADC_SC1P_COCO_WIDTH                      (1U)
#define ADC_SC1P_COCO(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_SC1P_COCO_SHIFT)) & ADC_SC1P_COCO_MASK)
/*! @} */

/*! @name CFG1 - ADC Configuration Register 1 */
/*! @{ */

#define ADC_CFG1_ADICLK_MASK                     (0x3U)
#define ADC_CFG1_ADICLK_SHIFT                    (0U)
#define ADC_CFG1_ADICLK_WIDTH                    (2U)
#define ADC_CFG1_ADICLK(x)                       (((uint32_t)(((uint32_t)(x)) << ADC_CFG1_ADICLK_SHIFT)) & ADC_CFG1_ADICLK_MASK)

#define ADC_CFG1_MODE_MASK                       (0xCU)
#define ADC_CFG1_MODE_SHIFT                      (2U)
#define ADC_CFG1_MODE_WIDTH                      (2U)
#define ADC_CFG1_MODE(x)                         (((uint32_t)(((uint32_t)(x)) << ADC_CFG1_MODE_SHIFT)) & ADC_CFG1_MODE_MASK)

