renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/8_CAN_driver/Examples/CAN_Example2_Interrupt_Loop_Back_Mode/Autosar/Mcal/Base/header/S32K146_ADC.h
#define ADC_ASC1H_COCO_MASK                      (0x80U)
#define ADC_ASC1H_COCO_SHIFT                     (7U)
#define ADC_ASC1H_COCO_WIDTH                     (1U)
#define ADC_ASC1H_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1H_COCO_SHIFT)) & ADC_ASC1H_COCO_MASK)
/*! @} */

/*! @name ASC1I - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1I_ADCH_MASK                      (0x3FU)
#define ADC_ASC1I_ADCH_SHIFT                     (0U)
#define ADC_ASC1I_ADCH_WIDTH                     (6U)
#define ADC_ASC1I_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1I_ADCH_SHIFT)) & ADC_ASC1I_ADCH_MASK)

#define ADC_ASC1I_AIEN_MASK                      (0x40U)
#define ADC_ASC1I_AIEN_SHIFT                     (6U)
#define ADC_ASC1I_AIEN_WIDTH                     (1U)
#define ADC_ASC1I_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1I_AIEN_SHIFT)) & ADC_ASC1I_AIEN_MASK)

#define ADC_ASC1I_COCO_MASK                      (0x80U)
#define ADC_ASC1I_COCO_SHIFT                     (7U)
#define ADC_ASC1I_COCO_WIDTH                     (1U)
#define ADC_ASC1I_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1I_COCO_SHIFT)) & ADC_ASC1I_COCO_MASK)
/*! @} */

/*! @name ASC1J - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1J_ADCH_MASK                      (0x3FU)
#define ADC_ASC1J_ADCH_SHIFT                     (0U)
#define ADC_ASC1J_ADCH_WIDTH                     (6U)
#define ADC_ASC1J_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1J_ADCH_SHIFT)) & ADC_ASC1J_ADCH_MASK)

#define ADC_ASC1J_AIEN_MASK                      (0x40U)
#define ADC_ASC1J_AIEN_SHIFT                     (6U)
#define ADC_ASC1J_AIEN_WIDTH                     (1U)
#define ADC_ASC1J_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1J_AIEN_SHIFT)) & ADC_ASC1J_AIEN_MASK)

#define ADC_ASC1J_COCO_MASK                      (0x80U)
#define ADC_ASC1J_COCO_SHIFT                     (7U)
#define ADC_ASC1J_COCO_WIDTH                     (1U)
#define ADC_ASC1J_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1J_COCO_SHIFT)) & ADC_ASC1J_COCO_MASK)
/*! @} */

/*! @name ASC1K - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1K_ADCH_MASK                      (0x3FU)
#define ADC_ASC1K_ADCH_SHIFT                     (0U)
#define ADC_ASC1K_ADCH_WIDTH                     (6U)
#define ADC_ASC1K_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1K_ADCH_SHIFT)) & ADC_ASC1K_ADCH_MASK)

#define ADC_ASC1K_AIEN_MASK                      (0x40U)
#define ADC_ASC1K_AIEN_SHIFT                     (6U)
#define ADC_ASC1K_AIEN_WIDTH                     (1U)
#define ADC_ASC1K_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1K_AIEN_SHIFT)) & ADC_ASC1K_AIEN_MASK)

#define ADC_ASC1K_COCO_MASK                      (0x80U)
#define ADC_ASC1K_COCO_SHIFT                     (7U)
#define ADC_ASC1K_COCO_WIDTH                     (1U)
#define ADC_ASC1K_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1K_COCO_SHIFT)) & ADC_ASC1K_COCO_MASK)
/*! @} */

/*! @name ASC1L - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1L_ADCH_MASK                      (0x3FU)
#define ADC_ASC1L_ADCH_SHIFT                     (0U)
#define ADC_ASC1L_ADCH_WIDTH                     (6U)
#define ADC_ASC1L_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1L_ADCH_SHIFT)) & ADC_ASC1L_ADCH_MASK)

#define ADC_ASC1L_AIEN_MASK                      (0x40U)
#define ADC_ASC1L_AIEN_SHIFT                     (6U)
#define ADC_ASC1L_AIEN_WIDTH                     (1U)
#define ADC_ASC1L_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1L_AIEN_SHIFT)) & ADC_ASC1L_AIEN_MASK)

#define ADC_ASC1L_COCO_MASK                      (0x80U)
#define ADC_ASC1L_COCO_SHIFT                     (7U)
#define ADC_ASC1L_COCO_WIDTH                     (1U)
#define ADC_ASC1L_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1L_COCO_SHIFT)) & ADC_ASC1L_COCO_MASK)
/*! @} */

/*! @name ASC1M - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1M_ADCH_MASK                      (0x3FU)
#define ADC_ASC1M_ADCH_SHIFT                     (0U)
#define ADC_ASC1M_ADCH_WIDTH                     (6U)
#define ADC_ASC1M_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1M_ADCH_SHIFT)) & ADC_ASC1M_ADCH_MASK)

#define ADC_ASC1M_AIEN_MASK                      (0x40U)
#define ADC_ASC1M_AIEN_SHIFT                     (6U)
#define ADC_ASC1M_AIEN_WIDTH                     (1U)
#define ADC_ASC1M_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1M_AIEN_SHIFT)) & ADC_ASC1M_AIEN_MASK)

#define ADC_ASC1M_COCO_MASK                      (0x80U)
#define ADC_ASC1M_COCO_SHIFT                     (7U)
#define ADC_ASC1M_COCO_WIDTH                     (1U)
#define ADC_ASC1M_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1M_COCO_SHIFT)) & ADC_ASC1M_COCO_MASK)
/*! @} */

/*! @name ASC1N - ADC Status and Control Register 1 */
/*! @{ */

#define ADC_ASC1N_ADCH_MASK                      (0x3FU)
#define ADC_ASC1N_ADCH_SHIFT                     (0U)
#define ADC_ASC1N_ADCH_WIDTH                     (6U)
#define ADC_ASC1N_ADCH(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1N_ADCH_SHIFT)) & ADC_ASC1N_ADCH_MASK)

#define ADC_ASC1N_AIEN_MASK                      (0x40U)
#define ADC_ASC1N_AIEN_SHIFT                     (6U)
#define ADC_ASC1N_AIEN_WIDTH                     (1U)
#define ADC_ASC1N_AIEN(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1N_AIEN_SHIFT)) & ADC_ASC1N_AIEN_MASK)

#define ADC_ASC1N_COCO_MASK                      (0x80U)
#define ADC_ASC1N_COCO_SHIFT                     (7U)
#define ADC_ASC1N_COCO_WIDTH                     (1U)
#define ADC_ASC1N_COCO(x)                        (((uint32_t)(((uint32_t)(x)) << ADC_ASC1N_COCO_SHIFT)) & ADC_ASC1N_COCO_MASK)
/*! @} */

/*! @name ASC1O - ADC Status and Control Register 1 */
/*! @{ */

